#Дано целое число N (> 1). Вывести наибольшее из целых чисел K, для которых
# сумма 1 + 2 + ... + K будет меньше или равна N, и саму эту сумму.
try:
    # Запрашиваем у пользователя число n (> 1)
    n = int(input("Введите целое число n (> 1): "))

    if n <= 1:
        print("Ошибка: число должно быть строго больше 1.")
    else:
        k = 1
        c = 0

        # Цикл продолжается, пока добавление следующего k не превышает n
        while c + k <= n:
            c += k
            k += 1

# Так как в последней итерации цикла k увеличился на 1, итоговое наибольшее число k будет на единицу меньше
        k -= 1

        print(f"Наибольшее целое число K: {k}")
        print(f"Итоговая сумма (1 + 2 + ... + K): {c}")

except ValueError:
    print("Ошибка ввода! Пожалуйста, введите корректное целое число.")