# даны целые числа a, b, c. Проверить истинность высказывания:"Существует треугольник со сторонами a, b, c"

    # вводим данные
a, b, c = (input("Введите значение a: ")), (input("Введите значение b: ")), (input("Введите значение c: "))
while type(a) != float:  # оработка исключений
    try:
        a = float(a)
    except ValueError:
        print("Неправильно ввели")
        a = (input("Введите значение a: "))
while type(b) != float:  # оработка исключений
    try:
        b = float(b)
    except ValueError:
        print("Неправильно ввели")
        b = (input("Введите значение b: "))
while type(c) != float:  # оработка исключений
    try:
        c = float(c)
    except ValueError:
        print("Неправильно ввели")
        c = (input("Введите значение c: "))

    # вводим условие
if (a + b > c) and (a + c > b) and (b + c > a):
        # выводим результат
    print("Треугольник с данными сторонами существует")
else:
        # иначе выводим другой результат
    print("Треугольника с данными сторонами не существует")
