#Вариант 26.
# даны числа x, y. Проверить истинность высказывания:"Точка с координатами (x, y) лежит в четвёртой координатной четверти."
try:
    # вводим данные
    x = float(input("Введите значение x: "))
    y = float(input("Введите значение y: "))
    # вводим условие для координатной четверти
    if x > 0 and y < 0:
        # выводим результат
        print("Точка находится в четвёртой четверти")
    else:
        # иначе выводим другой результат
        print("Точка не находится в четвёртой четверти")
except ValueError:
    # ошибка при вводе
    print("Ошибка: пожалуйста, введите целое число!")