#Вариант 26.
# даны числа x, y. Проверить истинность высказывания:"Точка с координатами (x, y) лежит в четвёртой координатной четверти."

    # вводим данные
x, y = (input("Введите значение x: ")), (input("Введите значение y: "))
while type (x) != float: # оработка исключений
    try:
        x = float(x)
    except ValueError:
        print("Неправильно ввели")
        x = (input("Введите значение x: "))
while type (y) != float: # оработка исключений
    try:
        y = float(y)
    except ValueError:
        print("Неправильно ввели")
        y = (input("Введите значение y: "))
    # вводим условие для координатной четверти
if x > 0 and y < 0:
        # выводим результат
    print("Точка находится в четвёртой четверти")
else:
        # иначе выводим другой результат
    print("Точка не находится в четвёртой четверти")
