# даны целые числа a, b, c. Проверить истинность высказывания:"Существует треугольник со сторонами a, b, c"
try:
    # вводим данные
    a = int(input("Введите значение a: "))
    b = int(input("Введите значение b: "))
    c = int(input("Введите значение c: "))
    # вводим условие
    if (a + b > c) and (a + c > b) and (b + c > a):
        # выводим результат
        print("Треугольник с данными сторонами существует")
    else:
        # иначе выводим другой результат
        print("Треугольника с данными сторонами не существует")
except ValueError:
    # ошибка при вводе
    print("Ошибка: пожалуйста, введите целое число!")