#Вариант 26.
    # С начала суток прошло N секунд (N - целое). Найти количество секунд прошедших с начала последней минуты.
try:
    # ввод количества секунд и преобразование в целое число
    n = int(input("Введите количество секунд (N): "))
    # находим кол-во секунд, прошедших с начала последней минуты с помощью деления с остатком
    seconds_in_last_minute = n % 60
    # вывод результата
    print(f"Количество секунд с начала прошедшей минуты: {seconds_in_last_minute}")
except ValueError:
    # если произошла ошибка, пользователь ввёл не число, выполняем этот блок
    print("Ошибка: пожалуйста, введите целое число!")